Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 47, 47, 16)        208       
_________________________________________________________________
activation_14 (Activation)   (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_15 (Activation)   (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 22, 22, 16)        1040      
_________________________________________________________________
activation_16 (Activation)   (None, 22, 22, 16)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 21, 21, 16)        1040      
_________________________________________________________________
activation_17 (Activation)   (None, 21, 21, 16)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 10, 10, 16)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 10, 10, 16)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 16)                25616     
_________________________________________________________________
activation_18 (Activation)   (None, 16)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 32)                544       
_________________________________________________________________
activation_19 (Activation)   (None, 32)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 48)                1584      
_________________________________________________________________
activation_20 (Activation)   (None, 48)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 6)                 294       
=================================================================
Total params: 31,366
Trainable params: 31,366
Non-trainable params: 0
_________________________________________________________________
Accuracy : 47.89190590381622 %
Loss : 1.3326057195663452