Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 47, 47, 16)        208       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 46, 46, 16)        1040      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 23, 23, 16)        0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 23, 23, 16)        64        
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 22, 22, 16)        1040      
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 21, 21, 16)        1040      
_________________________________________________________________
batch_normalization_10 (Batc (None, 21, 21, 16)        64        
_________________________________________________________________
dropout_7 (Dropout)          (None, 21, 21, 16)        0         
_________________________________________________________________
global_average_pooling2d_5 ( (None, 16)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 16)                272       
_________________________________________________________________
batch_normalization_11 (Batc (None, 16)                64        
_________________________________________________________________
flatten_3 (Flatten)          (None, 16)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 6)                 102       
=================================================================
Total params: 3,894
Trainable params: 3,798
Non-trainable params: 96
_________________________________________________________________
Accuracy : 25.509336590766907 %
Loss : 1.8631328344345093