Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 47, 47, 16)        208       
_________________________________________________________________
activation_20 (Activation)   (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_21 (Activation)   (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 22, 22, 32)        2080      
_________________________________________________________________
activation_22 (Activation)   (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 21, 21, 32)        4128      
_________________________________________________________________
activation_23 (Activation)   (None, 21, 21, 32)        0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 10, 10, 32)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_14 (Dense)             (None, 32)                102432    
_________________________________________________________________
activation_24 (Activation)   (None, 32)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                2112      
_________________________________________________________________
activation_25 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 80)                5200      
_________________________________________________________________
activation_26 (Activation)   (None, 80)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 96)                7776      
_________________________________________________________________
activation_27 (Activation)   (None, 96)                0         
_________________________________________________________________
dense_18 (Dense)             (None, 128)               12416     
_________________________________________________________________
activation_28 (Activation)   (None, 128)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 144)               18576     
_________________________________________________________________
activation_29 (Activation)   (None, 144)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 6)                 870       
=================================================================
Total params: 156,838
Trainable params: 156,838
Non-trainable params: 0
_________________________________________________________________
Accuracy : 48.443689942359924 %
Loss : 1.328492283821106