Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 47, 47, 8)         104       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 46, 46, 8)         264       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 23, 23, 8)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 22, 22, 16)        528       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 21, 21, 16)        1040      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1600)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                51232     
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 198       
=================================================================
Total params: 53,366
Trainable params: 53,366
Non-trainable params: 0
_________________________________________________________________
Accuracy : 26.853424310684204 %
Loss : 1.713063359260559