Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 48, 48, 16)        64        
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 48, 48, 16)        272       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 24, 24, 16)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 24, 24, 16)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 23, 23, 16)        1040      
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 22, 22, 16)        1040      
_________________________________________________________________
dropout_5 (Dropout)          (None, 22, 22, 16)        0         
_________________________________________________________________
global_average_pooling2d_2 ( (None, 16)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 16)                272       
_________________________________________________________________
flatten_2 (Flatten)          (None, 16)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 6)                 102       
=================================================================
Total params: 2,790
Trainable params: 2,790
Non-trainable params: 0
_________________________________________________________________
Accuracy : 25.95500946044922 %
Loss : 1.7395800352096558