Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 47, 47, 16)        208       
_________________________________________________________________
activation_10 (Activation)   (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_11 (Activation)   (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 22, 22, 32)        2080      
_________________________________________________________________
activation_12 (Activation)   (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 21, 21, 32)        4128      
_________________________________________________________________
activation_13 (Activation)   (None, 21, 21, 32)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 10, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 64)                204864    
_________________________________________________________________
activation_14 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 128)               8320      
_________________________________________________________________
activation_15 (Activation)   (None, 128)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 128)               16512     
_________________________________________________________________
activation_16 (Activation)   (None, 128)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               33024     
_________________________________________________________________
activation_17 (Activation)   (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 256)               65792     
_________________________________________________________________
activation_18 (Activation)   (None, 256)               0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
dense_12 (Dense)             (None, 256)               65792     
_________________________________________________________________
activation_19 (Activation)   (None, 256)               0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 256)               1024      
_________________________________________________________________
dense_13 (Dense)             (None, 6)                 1542      
=================================================================
Total params: 405,350
Trainable params: 404,326
Non-trainable params: 1,024
_________________________________________________________________
Accuracy : 52.150535583496094 %
Loss : 1.2582138776779175