Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 47, 47, 16)        208       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 23, 23, 16)        0         
_________________________________________________________________
dropout (Dropout)            (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 22, 22, 16)        1040      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 21, 16)        1040      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 10, 16)        0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 16)                272       
_________________________________________________________________
dense_1 (Dense)              (None, 32)                544       
_________________________________________________________________
dense_2 (Dense)              (None, 6)                 198       
=================================================================
Total params: 4,342
Trainable params: 4,342
Non-trainable params: 0
_________________________________________________________________
Accuracy : 25.519949197769165 %
Loss : 1.7599538564682007