Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 47, 47, 8)         104       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 46, 46, 8)         264       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 23, 23, 8)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 22, 22, 16)        528       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 21, 16)        1040      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 1600)              0         
_________________________________________________________________
dense (Dense)                (None, 32)                51232     
_________________________________________________________________
dense_1 (Dense)              (None, 6)                 198       
=================================================================
Total params: 53,366
Trainable params: 53,366
Non-trainable params: 0
_________________________________________________________________
Accuracy : 35.79513430595398 %
Loss : 1.6014163494110107