Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 47, 47, 16)        208       
_________________________________________________________________
activation_4 (Activation)    (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_5 (Activation)    (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 23, 23, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8464)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                270880    
_________________________________________________________________
activation_6 (Activation)    (None, 32)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               8448      
_________________________________________________________________
activation_7 (Activation)    (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 6)                 1542      
=================================================================
Total params: 282,118
Trainable params: 282,118
Non-trainable params: 0
_________________________________________________________________
Accuracy : 44.821733236312866 %
Loss : 1.419466257095337