Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 47, 47, 8)         104       
_________________________________________________________________
activation (Activation)      (None, 47, 47, 8)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 46, 46, 8)         264       
_________________________________________________________________
activation_1 (Activation)    (None, 46, 46, 8)         0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 23, 23, 8)         0         
_________________________________________________________________
dropout (Dropout)            (None, 23, 23, 8)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 22, 22, 16)        528       
_________________________________________________________________
activation_2 (Activation)    (None, 22, 22, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 21, 16)        1040      
_________________________________________________________________
activation_3 (Activation)    (None, 21, 21, 16)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 10, 16)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 9, 9, 16)          1040      
_________________________________________________________________
activation_4 (Activation)    (None, 9, 9, 16)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 16)          1040      
_________________________________________________________________
activation_5 (Activation)    (None, 8, 8, 16)          0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 16)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4, 4, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 16)                4112      
_________________________________________________________________
activation_6 (Activation)    (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                544       
_________________________________________________________________
activation_7 (Activation)    (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 48)                1584      
_________________________________________________________________
activation_8 (Activation)    (None, 48)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                3136      
_________________________________________________________________
activation_9 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 390       
=================================================================
Total params: 13,782
Trainable params: 13,782
Non-trainable params: 0
_________________________________________________________________
Accuracy : 46.47707939147949 %
Loss : 1.3771710395812988