Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 47, 47, 16)        208       
_________________________________________________________________
activation (Activation)      (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_1 (Activation)    (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 23, 23, 16)        0         
_________________________________________________________________
dropout (Dropout)            (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 22, 22, 32)        2080      
_________________________________________________________________
activation_2 (Activation)    (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 21, 32)        4128      
_________________________________________________________________
activation_3 (Activation)    (None, 21, 21, 32)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 10, 10, 32)        0         
_________________________________________________________________
flatten (Flatten)            (None, 3200)              0         
_________________________________________________________________
dense (Dense)                (None, 32)                102432    
_________________________________________________________________
activation_4 (Activation)    (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 48)                1584      
_________________________________________________________________
activation_5 (Activation)    (None, 48)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                3136      
_________________________________________________________________
activation_6 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 80)                5200      
_________________________________________________________________
activation_7 (Activation)    (None, 80)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               10368     
_________________________________________________________________
activation_8 (Activation)    (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 6)                 774       
=================================================================
Total params: 130,950
Trainable params: 130,950
Non-trainable params: 0
_________________________________________________________________
Accuracy : 49.53310787677765 %
Loss : 1.3121731281280518