Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 47, 47, 16)        208       
_________________________________________________________________
activation_9 (Activation)    (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_10 (Activation)   (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 23, 23, 16)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 23, 23, 16)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 22, 22, 32)        2080      
_________________________________________________________________
activation_11 (Activation)   (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 21, 21, 32)        4128      
_________________________________________________________________
activation_12 (Activation)   (None, 21, 21, 32)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 10, 32)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 10, 10, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 3200)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 32)                102432    
_________________________________________________________________
activation_13 (Activation)   (None, 32)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 48)                1584      
_________________________________________________________________
activation_14 (Activation)   (None, 48)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 64)                3136      
_________________________________________________________________
activation_15 (Activation)   (None, 64)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 80)                5200      
_________________________________________________________________
activation_16 (Activation)   (None, 80)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               10368     
_________________________________________________________________
activation_17 (Activation)   (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 6)                 774       
=================================================================
Total params: 130,950
Trainable params: 130,950
Non-trainable params: 0
_________________________________________________________________
Accuracy : 49.17939901351929 %
Loss : 1.327384114265442