Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 47, 47, 16)        208       
_________________________________________________________________
activation (Activation)      (None, 47, 47, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 46, 46, 16)        1040      
_________________________________________________________________
activation_1 (Activation)    (None, 46, 46, 16)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 23, 23, 16)        0         
_________________________________________________________________
dropout (Dropout)            (None, 23, 23, 16)        0         
_________________________________________________________________
flatten (Flatten)            (None, 8464)              0         
_________________________________________________________________
dense (Dense)                (None, 256)               2167040   
_________________________________________________________________
activation_2 (Activation)    (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 6)                 1542      
=================================================================
Total params: 2,169,830
Trainable params: 2,169,830
Non-trainable params: 0
_________________________________________________________________
Accuracy : 42.68534183502197 %
Loss : 1.5254005193710327